FKDD_COPY_DIFF_3_2026-02-13/Enums/КодыОбработкиЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КодыОбработкиЗапроса</Name>
			<Comment>Коды обработки запроса КМ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапросИмеетКорректныйФормат</Name>
					<Comment>Запрос имеет корректный формат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросИмеетНекорректныйФормат</Name>
					<Comment>Запрос имеет некорректный формат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КМИмеетНекорректныйФормат</Name>
					<Comment>КМ Имеет некорректный формат</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/КодыОбработкиЗапроса/Ext/ManagerModule.bsl
Функция РезультатОбработкиЗапроса(РезультатОбработкиКод) Экспорт
	
	РезультатОбработки = Перечисления.КодыОбработкиЗапроса.ПустаяСсылка();
	
	Если РезультатОбработкиКод = 0 Тогда
		РезультатОбработки = Перечисления.КодыОбработкиЗапроса.ЗапросИмеетКорректныйФормат;
	ИначеЕсли РезультатОбработкиКод = 1 Тогда 
		РезультатОбработки = Перечисления.КодыОбработкиЗапроса.ЗапросИмеетНекорректныйФормат;
	ИначеЕсли РезультатОбработкиКод = 2 Тогда 
		РезультатОбработки = Перечисления.КодыОбработкиЗапроса.КМИмеетНекорректныйФормат;
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции
